zoussu/micropython-freegpio19/ports/esp32/boards/ESP32_GENERIC_C3/mpconfigboard.h
// This configuration is for a generic ESP32C3 board with 4MiB (or more) of flash.

#define MICROPY_HW_BOARD_NAME               "ESP32C3 module"
#define MICROPY_HW_MCU_NAME                 "ESP32-C3"

#define MICROPY_HW_ENABLE_UART_REPL         (1)
#define MICROPY_HW_ESP_USB_SERIAL_JTAG      (0)
